#include <stdio.h>

int main(){
    char buffer [10];
    char first[21]; //* Первый вариант объявления строки. Все строки заканчиваются тернарным нулем. пПоэтому надо всегда резервировать 1 ячейку для этого нуля. Мы выделили 20 ячеек для самой строки и 1 ячейку для нуля
    char second[] = "Hello everybody!"; //! Это 2 способ. Нуль добавляется автоматически, символьные строки помещаются в статическую память, длину строки компилятор вычислит автоматически!
    char *s = "Third variation of string"; //? Третий способ через указатель

    //? Правильное выделение памяти для строки:
    char *str = (char *)malloc(sizeof(char) * (strlen(buffer)+1));

    //Тут ка краз таки мы умножаем сам тип элемента не только на количество и длину строки но и всегда +1 (это наш тренарный ноль)
}